; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct.__uclibc_locale_struct.205 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.204 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!76 = !{!6, !7}
!77 = !{!72, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 55)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !83, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "n_calls", scope: !93, file: !94, line: 1342, type: !45, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "getcwd", scope: !94, file: !94, line: 1341, type: !95, scopeLine: 1341, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!94 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee")
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !7, !23}
!97 = distinct !DICompileUnit(language: DW_LANG_C89, file: !98, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !120, globals: !179, splitDebugInlining: false, nameTableKind: None)
!98 = !DIFile(filename: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/runtime/POSIX/fd.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/build/runtime/POSIX")
!99 = !{!100, !108}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 46, baseType: !102, size: 32, elements: !103)
!101 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "eOpen", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "eCloseOnExec", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "eReadable", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "eWriteable", value: 8, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 97, baseType: !102, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119}
!111 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!116 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!118 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!119 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!120 = !{!121, !6, !122, !10, !126, !7, !141, !45, !8}
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !123, line: 92, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 153, baseType: !121)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !128, line: 37, size: 2240, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!129 = !{!130, !132, !133, !135, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !127, file: !128, line: 39, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !125, line: 149, baseType: !10)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !127, file: !128, line: 40, baseType: !124, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !127, file: !128, line: 41, baseType: !134, size: 16, offset: 128)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !127, file: !128, line: 42, baseType: !136, size: 8, offset: 144)
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !127, file: !128, line: 43, baseType: !138, size: 2048, offset: 152)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !143, line: 46, size: 1152, elements: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!144 = !{!145, !147, !149, !151, !153, !155, !157, !158, !159, !161, !163, !165, !173, !174, !175}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !142, file: !143, line: 48, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 145, baseType: !10)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !142, file: !143, line: 53, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 148, baseType: !10)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !142, file: !143, line: 61, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 151, baseType: !10)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !142, file: !143, line: 62, baseType: !152, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 150, baseType: !102)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !142, file: !143, line: 64, baseType: !154, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 146, baseType: !102)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !142, file: !143, line: 65, baseType: !156, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 147, baseType: !102)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !142, file: !143, line: 67, baseType: !45, size: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !142, file: !143, line: 69, baseType: !146, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !142, file: !143, line: 74, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 152, baseType: !121)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !142, file: !143, line: 78, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 174, baseType: !121)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !142, file: !143, line: 80, baseType: !164, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 179, baseType: !121)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !142, file: !143, line: 91, baseType: !166, size: 128, offset: 576)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !167, line: 10, size: 128, elements: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !166, file: !167, line: 12, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 160, baseType: !121)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !166, file: !167, line: 16, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 196, baseType: !121)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !142, file: !143, line: 92, baseType: !166, size: 128, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !142, file: !143, line: 93, baseType: !166, size: 128, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !142, file: !143, line: 106, baseType: !176, size: 192, offset: 960)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !{!180, !185, !192, !199, !205, !210, !91}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "n_calls", scope: !182, file: !94, line: 313, type: !45, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "close", scope: !94, file: !94, line: 312, type: !183, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!183 = !DISubroutineType(types: !184)
!184 = !{!45, !45}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "n_calls", scope: !187, file: !94, line: 345, type: !45, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "read", scope: !94, file: !94, line: 344, type: !188, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !45, !6, !23}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !123, line: 108, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !125, line: 193, baseType: !121)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "n_calls", scope: !194, file: !94, line: 411, type: !45, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "write", scope: !94, file: !94, line: 410, type: !195, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!195 = !DISubroutineType(types: !196)
!196 = !{!190, !45, !197, !23}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "n_calls", scope: !201, file: !94, line: 642, type: !45, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "chmod", scope: !94, file: !94, line: 641, type: !202, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!202 = !DISubroutineType(types: !203)
!203 = !{!45, !29, !204}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !123, line: 69, baseType: !152)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "n_calls", scope: !207, file: !94, line: 661, type: !45, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "fchmod", scope: !94, file: !94, line: 660, type: !208, scopeLine: 660, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!208 = !DISubroutineType(types: !209)
!209 = !{!45, !45, !204}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "n_calls", scope: !212, file: !94, line: 747, type: !45, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !94, file: !94, line: 746, type: !213, scopeLine: 746, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!213 = !DISubroutineType(types: !214)
!214 = !{!45, !45, !122}
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !217, file: !252, line: 375, type: !491, isLocal: false, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !219, retainedTypes: !241, globals: !294, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!219 = !{!220, !226}
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 90, baseType: !102, size: 32, elements: !222)
!221 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!222 = !{!223, !224, !225}
!223 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0, isUnsigned: true)
!224 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 48, baseType: !102, size: 32, elements: !228)
!227 = !DIFile(filename: "./include/ctype.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!229 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!230 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!232 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!233 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!234 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!235 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!236 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!237 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!241 = !{!45, !242, !7, !243, !245, !248, !136, !249, !250, !263, !271, !10}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !134)
!248 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !252, line: 400, baseType: !253)
!252 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 390, size: 128, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !253, file: !252, line: 391, baseType: !247, size: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !253, file: !252, line: 392, baseType: !247, size: 16, offset: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !253, file: !252, line: 393, baseType: !247, size: 16, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !253, file: !252, line: 394, baseType: !247, size: 16, offset: 48)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !253, file: !252, line: 396, baseType: !247, size: 16, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !253, file: !252, line: 397, baseType: !247, size: 16, offset: 80)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !253, file: !252, line: 398, baseType: !247, size: 16, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !253, file: !252, line: 399, baseType: !247, size: 16, offset: 112)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !252, line: 430, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 425, size: 64, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !265, file: !252, line: 426, baseType: !247, size: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !265, file: !252, line: 427, baseType: !247, size: 16, offset: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !265, file: !252, line: 428, baseType: !247, size: 16, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !265, file: !252, line: 429, baseType: !247, size: 16, offset: 48)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !252, line: 423, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 402, size: 304, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !273, file: !252, line: 403, baseType: !247, size: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !273, file: !252, line: 404, baseType: !247, size: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !273, file: !252, line: 405, baseType: !247, size: 16, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !273, file: !252, line: 406, baseType: !247, size: 16, offset: 48)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !273, file: !252, line: 407, baseType: !247, size: 16, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !273, file: !252, line: 408, baseType: !247, size: 16, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !273, file: !252, line: 409, baseType: !247, size: 16, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !273, file: !252, line: 410, baseType: !247, size: 16, offset: 112)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !273, file: !252, line: 411, baseType: !247, size: 16, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !273, file: !252, line: 412, baseType: !247, size: 16, offset: 144)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !273, file: !252, line: 413, baseType: !247, size: 16, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !273, file: !252, line: 414, baseType: !247, size: 16, offset: 176)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !273, file: !252, line: 415, baseType: !247, size: 16, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !273, file: !252, line: 416, baseType: !247, size: 16, offset: 208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !273, file: !252, line: 418, baseType: !247, size: 16, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !273, file: !252, line: 419, baseType: !247, size: 16, offset: 240)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !273, file: !252, line: 420, baseType: !247, size: 16, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !273, file: !252, line: 421, baseType: !247, size: 16, offset: 272)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !273, file: !252, line: 422, baseType: !247, size: 16, offset: 288)
!294 = !{!295, !479, !215, !481, !484, !486}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "__global_locale", scope: !217, file: !252, line: 377, type: !297, isLocal: false, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !221, line: 330, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !221, line: 154, size: 26560, elements: !300)
!300 = !{!301, !308, !314, !315, !319, !321, !322, !326, !330, !332, !333, !334, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !353, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !299, file: !221, line: 156, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !305, line: 38, baseType: !306)
!305 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !307, line: 44, baseType: !134)
!307 = !DIFile(filename: "./include/bits/types.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !299, file: !221, line: 157, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !305, line: 42, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !307, line: 43, baseType: !313)
!313 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !299, file: !221, line: 158, baseType: !309, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !299, file: !221, line: 162, baseType: !316, size: 6144, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 6144, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !299, file: !221, line: 163, baseType: !320, size: 6144, offset: 6336)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 6144, elements: !317)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !299, file: !221, line: 164, baseType: !320, size: 6144, offset: 12480)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !299, file: !221, line: 168, baseType: !323, size: 112, offset: 18624)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 112, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 14)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !299, file: !221, line: 174, baseType: !327, size: 96, offset: 18736)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 96, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 6)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !299, file: !221, line: 175, baseType: !331, size: 48, offset: 18832)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 48, elements: !328)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !299, file: !221, line: 178, baseType: !136, size: 8, offset: 18880)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !299, file: !221, line: 179, baseType: !136, size: 8, offset: 18888)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !299, file: !221, line: 180, baseType: !335, size: 80, offset: 18896)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 80, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 10)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !299, file: !221, line: 183, baseType: !243, size: 64, offset: 19008)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !299, file: !221, line: 184, baseType: !243, size: 64, offset: 19072)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !299, file: !221, line: 185, baseType: !243, size: 64, offset: 19136)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !299, file: !221, line: 186, baseType: !243, size: 64, offset: 19200)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !299, file: !221, line: 188, baseType: !243, size: 64, offset: 19264)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !299, file: !221, line: 189, baseType: !245, size: 64, offset: 19328)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !299, file: !221, line: 190, baseType: !243, size: 64, offset: 19392)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !299, file: !221, line: 191, baseType: !243, size: 64, offset: 19456)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !299, file: !221, line: 197, baseType: !245, size: 64, offset: 19520)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !299, file: !221, line: 199, baseType: !243, size: 64, offset: 19584)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !299, file: !221, line: 200, baseType: !243, size: 64, offset: 19648)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !299, file: !221, line: 202, baseType: !350, size: 64, offset: 19712)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !313)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !299, file: !221, line: 205, baseType: !354, size: 32, offset: 19776)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !299, file: !221, line: 206, baseType: !354, size: 32, offset: 19808)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !299, file: !221, line: 207, baseType: !45, size: 32, offset: 19840)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !299, file: !221, line: 208, baseType: !45, size: 32, offset: 19872)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !299, file: !221, line: 213, baseType: !29, size: 64, offset: 19904)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !299, file: !221, line: 214, baseType: !29, size: 64, offset: 19968)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !299, file: !221, line: 215, baseType: !29, size: 64, offset: 20032)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !299, file: !221, line: 216, baseType: !29, size: 64, offset: 20096)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !299, file: !221, line: 217, baseType: !29, size: 64, offset: 20160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !299, file: !221, line: 218, baseType: !29, size: 64, offset: 20224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !299, file: !221, line: 219, baseType: !29, size: 64, offset: 20288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !299, file: !221, line: 220, baseType: !29, size: 64, offset: 20352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !299, file: !221, line: 221, baseType: !29, size: 64, offset: 20416)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !299, file: !221, line: 222, baseType: !29, size: 64, offset: 20480)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !299, file: !221, line: 223, baseType: !29, size: 64, offset: 20544)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !299, file: !221, line: 226, baseType: !29, size: 64, offset: 20608)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !299, file: !221, line: 227, baseType: !29, size: 64, offset: 20672)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !299, file: !221, line: 228, baseType: !29, size: 64, offset: 20736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !299, file: !221, line: 231, baseType: !29, size: 64, offset: 20800)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !299, file: !221, line: 232, baseType: !29, size: 64, offset: 20864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !299, file: !221, line: 233, baseType: !29, size: 64, offset: 20928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !299, file: !221, line: 234, baseType: !29, size: 64, offset: 20992)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !299, file: !221, line: 235, baseType: !29, size: 64, offset: 21056)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !299, file: !221, line: 236, baseType: !29, size: 64, offset: 21120)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !299, file: !221, line: 237, baseType: !29, size: 64, offset: 21184)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !299, file: !221, line: 238, baseType: !29, size: 64, offset: 21248)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !299, file: !221, line: 239, baseType: !29, size: 64, offset: 21312)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !299, file: !221, line: 240, baseType: !29, size: 64, offset: 21376)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !299, file: !221, line: 241, baseType: !29, size: 64, offset: 21440)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !299, file: !221, line: 242, baseType: !29, size: 64, offset: 21504)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !299, file: !221, line: 243, baseType: !29, size: 64, offset: 21568)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !299, file: !221, line: 244, baseType: !29, size: 64, offset: 21632)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !299, file: !221, line: 245, baseType: !29, size: 64, offset: 21696)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !299, file: !221, line: 246, baseType: !29, size: 64, offset: 21760)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !299, file: !221, line: 247, baseType: !29, size: 64, offset: 21824)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !299, file: !221, line: 248, baseType: !29, size: 64, offset: 21888)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !299, file: !221, line: 249, baseType: !29, size: 64, offset: 21952)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !299, file: !221, line: 250, baseType: !29, size: 64, offset: 22016)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !299, file: !221, line: 251, baseType: !29, size: 64, offset: 22080)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !299, file: !221, line: 253, baseType: !29, size: 64, offset: 22144)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !299, file: !221, line: 256, baseType: !29, size: 64, offset: 22208)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !299, file: !221, line: 257, baseType: !29, size: 64, offset: 22272)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !299, file: !221, line: 258, baseType: !29, size: 64, offset: 22336)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !299, file: !221, line: 259, baseType: !29, size: 64, offset: 22400)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !299, file: !221, line: 260, baseType: !29, size: 64, offset: 22464)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !299, file: !221, line: 261, baseType: !29, size: 64, offset: 22528)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !299, file: !221, line: 262, baseType: !29, size: 64, offset: 22592)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !299, file: !221, line: 264, baseType: !29, size: 64, offset: 22656)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !299, file: !221, line: 265, baseType: !29, size: 64, offset: 22720)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !299, file: !221, line: 266, baseType: !29, size: 64, offset: 22784)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !299, file: !221, line: 267, baseType: !29, size: 64, offset: 22848)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !299, file: !221, line: 268, baseType: !29, size: 64, offset: 22912)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !299, file: !221, line: 269, baseType: !29, size: 64, offset: 22976)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !299, file: !221, line: 270, baseType: !29, size: 64, offset: 23040)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !299, file: !221, line: 272, baseType: !29, size: 64, offset: 23104)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !299, file: !221, line: 273, baseType: !29, size: 64, offset: 23168)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !299, file: !221, line: 274, baseType: !29, size: 64, offset: 23232)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !299, file: !221, line: 275, baseType: !29, size: 64, offset: 23296)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !299, file: !221, line: 276, baseType: !29, size: 64, offset: 23360)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !299, file: !221, line: 277, baseType: !29, size: 64, offset: 23424)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !299, file: !221, line: 278, baseType: !29, size: 64, offset: 23488)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !299, file: !221, line: 279, baseType: !29, size: 64, offset: 23552)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !299, file: !221, line: 280, baseType: !29, size: 64, offset: 23616)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !299, file: !221, line: 281, baseType: !29, size: 64, offset: 23680)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !299, file: !221, line: 282, baseType: !29, size: 64, offset: 23744)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !299, file: !221, line: 283, baseType: !29, size: 64, offset: 23808)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !299, file: !221, line: 285, baseType: !29, size: 64, offset: 23872)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !299, file: !221, line: 286, baseType: !29, size: 64, offset: 23936)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !299, file: !221, line: 287, baseType: !29, size: 64, offset: 24000)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !299, file: !221, line: 288, baseType: !29, size: 64, offset: 24064)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !299, file: !221, line: 289, baseType: !29, size: 64, offset: 24128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !299, file: !221, line: 290, baseType: !29, size: 64, offset: 24192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !299, file: !221, line: 291, baseType: !29, size: 64, offset: 24256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !299, file: !221, line: 292, baseType: !29, size: 64, offset: 24320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !299, file: !221, line: 293, baseType: !29, size: 64, offset: 24384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !299, file: !221, line: 294, baseType: !29, size: 64, offset: 24448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !299, file: !221, line: 295, baseType: !29, size: 64, offset: 24512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !299, file: !221, line: 296, baseType: !29, size: 64, offset: 24576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !299, file: !221, line: 298, baseType: !29, size: 64, offset: 24640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !299, file: !221, line: 299, baseType: !29, size: 64, offset: 24704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !299, file: !221, line: 301, baseType: !29, size: 64, offset: 24768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !299, file: !221, line: 302, baseType: !29, size: 64, offset: 24832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !299, file: !221, line: 303, baseType: !29, size: 64, offset: 24896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !299, file: !221, line: 304, baseType: !29, size: 64, offset: 24960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !299, file: !221, line: 305, baseType: !29, size: 64, offset: 25024)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !299, file: !221, line: 307, baseType: !29, size: 64, offset: 25088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !299, file: !221, line: 308, baseType: !29, size: 64, offset: 25152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !299, file: !221, line: 309, baseType: !29, size: 64, offset: 25216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !299, file: !221, line: 310, baseType: !29, size: 64, offset: 25280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !299, file: !221, line: 311, baseType: !29, size: 64, offset: 25344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !299, file: !221, line: 316, baseType: !29, size: 64, offset: 25408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !299, file: !221, line: 317, baseType: !29, size: 64, offset: 25472)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !299, file: !221, line: 318, baseType: !29, size: 64, offset: 25536)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !299, file: !221, line: 319, baseType: !29, size: 64, offset: 25600)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !299, file: !221, line: 322, baseType: !449, size: 896, offset: 25664)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !221, line: 149, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 111, size: 896, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !477, !478}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !450, file: !221, line: 112, baseType: !247, size: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !450, file: !221, line: 113, baseType: !247, size: 16, offset: 16)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !450, file: !221, line: 114, baseType: !247, size: 16, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !450, file: !221, line: 115, baseType: !247, size: 16, offset: 48)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !450, file: !221, line: 116, baseType: !247, size: 16, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !450, file: !221, line: 117, baseType: !247, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !450, file: !221, line: 118, baseType: !247, size: 16, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !450, file: !221, line: 119, baseType: !247, size: 16, offset: 112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !450, file: !221, line: 120, baseType: !247, size: 16, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !450, file: !221, line: 121, baseType: !247, size: 16, offset: 144)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !450, file: !221, line: 122, baseType: !247, size: 16, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !450, file: !221, line: 123, baseType: !247, size: 16, offset: 176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !450, file: !221, line: 124, baseType: !247, size: 16, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !450, file: !221, line: 125, baseType: !247, size: 16, offset: 208)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !450, file: !221, line: 127, baseType: !247, size: 16, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !450, file: !221, line: 128, baseType: !247, size: 16, offset: 240)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !450, file: !221, line: 130, baseType: !245, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !450, file: !221, line: 131, baseType: !245, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !450, file: !221, line: 132, baseType: !245, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !450, file: !221, line: 135, baseType: !245, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !450, file: !221, line: 138, baseType: !245, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !450, file: !221, line: 141, baseType: !245, size: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !450, file: !221, line: 142, baseType: !245, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !450, file: !221, line: 145, baseType: !476, size: 64, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !450, file: !221, line: 146, baseType: !476, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !450, file: !221, line: 148, baseType: !247, size: 16, offset: 832)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !217, file: !252, line: 380, type: !297, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "utf8", scope: !217, file: !252, line: 387, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !328)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "ascii", scope: !217, file: !252, line: 388, type: !483, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "__code2flag", scope: !217, file: !252, line: 854, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 256, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 16)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !221, line: 324, baseType: !299)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !494, file: !495, line: 131, type: !539, isLocal: true, isDefinition: true)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !496, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!496 = !{!497, !529, !531, !533, !535, !537, !492}
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "stdin", scope: !494, file: !495, line: 154, type: !499, isLocal: false, isDefinition: true)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !501, line: 46, baseType: !502)
!501 = !DIFile(filename: "./include/stdio.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !503, line: 233, size: 704, elements: !504)
!503 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!504 = !{!505, !506, !510, !511, !512, !513, !514, !515, !516, !517, !519, !521, !528}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !502, file: !503, line: 234, baseType: !134, size: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !502, file: !503, line: 237, baseType: !507, size: 16, offset: 16)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 16, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 2)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !502, file: !503, line: 244, baseType: !45, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !502, file: !503, line: 246, baseType: !249, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !502, file: !503, line: 247, baseType: !249, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !502, file: !503, line: 248, baseType: !249, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !502, file: !503, line: 249, baseType: !249, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !502, file: !503, line: 252, baseType: !249, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !502, file: !503, line: 255, baseType: !249, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !502, file: !503, line: 261, baseType: !518, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !502, file: !503, line: 268, baseType: !520, size: 64, offset: 512)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !508)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !502, file: !503, line: 271, baseType: !522, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !523, line: 85, baseType: !524)
!523 = !DIFile(filename: "./include/wchar.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 81, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !524, file: !523, line: 83, baseType: !354, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !524, file: !523, line: 84, baseType: !354, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !502, file: !503, line: 274, baseType: !6, size: 64, offset: 640)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "stdout", scope: !494, file: !495, line: 155, type: !499, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "stderr", scope: !494, file: !495, line: 156, type: !499, isLocal: false, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "__stdin", scope: !494, file: !495, line: 159, type: !499, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "__stdout", scope: !494, file: !495, line: 162, type: !499, isLocal: false, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !494, file: !495, line: 180, type: !499, isLocal: false, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 2112, elements: !177)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !542, file: !545, line: 309, type: !546, isLocal: false, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !544, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!544 = !{!540}
!545 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/klee-uclibc")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !45}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "exit_failure", scope: !551, file: !552, line: 24, type: !554, isLocal: false, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !553, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!553 = !{!549}
!554 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "program_name", scope: !557, file: !558, line: 33, type: !29, isLocal: false, isDefinition: true)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !559, globals: !608, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "../lib/progname.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!559 = !{!6, !560, !7}
!560 = !DISubprogram(name: "fputs", scope: !561, file: !561, line: 626, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!561 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!562 = !DISubroutineType(types: !563)
!563 = !{!45, !29, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !566, line: 49, size: 1728, elements: !567)
!566 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !583, !584, !585, !586, !587, !588, !589, !593, !596, !597, !600, !603, !604, !605, !606, !607}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !565, file: !566, line: 51, baseType: !45, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !565, file: !566, line: 54, baseType: !7, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !565, file: !566, line: 55, baseType: !7, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !565, file: !566, line: 56, baseType: !7, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !565, file: !566, line: 57, baseType: !7, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !565, file: !566, line: 58, baseType: !7, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !565, file: !566, line: 59, baseType: !7, size: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !565, file: !566, line: 60, baseType: !7, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !565, file: !566, line: 61, baseType: !7, size: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !565, file: !566, line: 64, baseType: !7, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !565, file: !566, line: 65, baseType: !7, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !565, file: !566, line: 66, baseType: !7, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !565, file: !566, line: 68, baseType: !581, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !566, line: 36, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !565, file: !566, line: 70, baseType: !564, size: 64, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !565, file: !566, line: 72, baseType: !45, size: 32, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !565, file: !566, line: 73, baseType: !45, size: 32, offset: 928)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !565, file: !566, line: 74, baseType: !160, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !565, file: !566, line: 77, baseType: !134, size: 16, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !565, file: !566, line: 78, baseType: !248, size: 8, offset: 1040)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !565, file: !566, line: 79, baseType: !590, size: 8, offset: 1048)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 1)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !565, file: !566, line: 81, baseType: !594, size: 64, offset: 1088)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !566, line: 43, baseType: null)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !565, file: !566, line: 89, baseType: !124, size: 64, offset: 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !565, file: !566, line: 91, baseType: !598, size: 64, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !566, line: 37, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !565, file: !566, line: 92, baseType: !601, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !566, line: 38, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !565, file: !566, line: 93, baseType: !564, size: 64, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !565, file: !566, line: 94, baseType: !6, size: 64, offset: 1408)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !565, file: !566, line: 95, baseType: !23, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !565, file: !566, line: 96, baseType: !45, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !565, file: !566, line: 98, baseType: !80, size: 160, offset: 1568)
!608 = !{!555}
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !611, file: !612, line: 1044, type: !645, isLocal: false, isDefinition: true)
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !613, retainedTypes: !635, globals: !704, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!613 = !{!614, !628, !633}
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !615, line: 32, baseType: !102, size: 32, elements: !616)
!615 = !DIFile(filename: "../lib/quotearg.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!617 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!618 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!619 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!620 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!621 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!622 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!623 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!624 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!625 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!626 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!627 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!628 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !615, line: 242, baseType: !102, size: 32, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!631 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!632 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 46, baseType: !102, size: 32, elements: !228)
!634 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!635 = !{!636, !640, !655, !658, !662, !45, !134, !665, !23, !682, !686, !29, !692, !696, !700}
!636 = !DISubprogram(name: "xmemdup", scope: !637, file: !637, line: 92, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!637 = !DIFile(filename: "../lib/xalloc.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!638 = !DISubroutineType(types: !639)
!639 = !{!6, !197, !10}
!640 = !DISubprogram(name: "quotearg_alloc_mem", scope: !615, file: !615, line: 346, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!641 = !DISubroutineType(types: !642)
!642 = !{!7, !29, !10, !9, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !612, line: 58, size: 448, elements: !646)
!646 = !{!647, !648, !649, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !645, file: !612, line: 61, baseType: !614, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !612, line: 64, baseType: !45, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !645, file: !612, line: 68, baseType: !650, size: 256, offset: 64)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 256, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 8)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !645, file: !612, line: 71, baseType: !29, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !645, file: !612, line: 74, baseType: !29, size: 64, offset: 384)
!655 = !DISubprogram(name: "xcharalloc", scope: !637, file: !637, line: 153, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!656 = !DISubroutineType(types: !657)
!657 = !{!7, !10}
!658 = !DISubprogram(name: "rpl_free", scope: !659, file: !659, line: 698, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!659 = !DIFile(filename: "./lib/wchar.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!660 = !DISubroutineType(types: !661)
!661 = !{null, !6}
!662 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !615, file: !615, line: 414, type: !663, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!663 = !DISubroutineType(types: !664)
!664 = !{!7, !45, !29, !29, !29, !10}
!665 = !DISubprogram(name: "rpl_mbrtowc", scope: !659, file: !659, line: 799, type: !666, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!666 = !DISubroutineType(types: !667)
!667 = !{!10, !668, !29, !10, !669}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !671, line: 13, size: 64, elements: !672)
!671 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !670, file: !671, line: 15, baseType: !45, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !670, file: !671, line: 20, baseType: !675, size: 32, offset: 32)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !671, line: 16, size: 32, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !675, file: !671, line: 18, baseType: !102, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !675, file: !671, line: 19, baseType: !679, size: 32)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 4)
!682 = !DISubprogram(name: "iswprint", scope: !683, file: !683, line: 120, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!683 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h", directory: "")
!684 = !DISubroutineType(types: !685)
!685 = !{!45, !102}
!686 = !DISubprogram(name: "mbsinit", scope: !687, file: !687, line: 292, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!687 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!688 = !DISubroutineType(types: !689)
!689 = !{!45, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!692 = !DISubprogram(name: "locale_charset", scope: !693, file: !693, line: 35, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!693 = !DIFile(filename: "../lib/localcharset.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!694 = !DISubroutineType(types: !695)
!695 = !{!29}
!696 = !DISubprogram(name: "c_strcasecmp", scope: !697, file: !697, line: 42, type: !698, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!697 = !DIFile(filename: "../lib/c-strcase.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!698 = !DISubroutineType(types: !699)
!699 = !{!45, !29, !29}
!700 = !DISubprogram(name: "xpalloc", scope: !637, file: !637, line: 90, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!701 = !DISubroutineType(types: !702)
!702 = !{!6, !6, !703, !121, !121, !121}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!704 = !{!705, !711, !609, !715, !717, !719, !726, !728}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !611, file: !612, line: 78, type: !707, isLocal: false, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 704, elements: !709)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!709 = !{!710}
!710 = !DISubrange(count: 11)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !611, file: !612, line: 94, type: !713, isLocal: false, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 320, elements: !336)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !611, file: !612, line: 109, type: !645, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "slot0", scope: !611, file: !612, line: 834, type: !138, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "slotvec", scope: !611, file: !612, line: 837, type: !721, isLocal: true, isDefinition: true)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !612, line: 826, size: 128, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !612, line: 828, baseType: !23, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !722, file: !612, line: 829, baseType: !7, size: 64, offset: 64)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "nslots", scope: !611, file: !612, line: 835, type: !45, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "slotvec0", scope: !611, file: !612, line: 836, type: !722, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !732, file: !733, line: 26, type: !735, isLocal: false, isDefinition: true)
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!734 = !{!730}
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 376, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 47)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "long_options", scope: !740, file: !741, line: 82, type: !970, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !742, retainedTypes: !819, globals: !952, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "../src/dircolors.c", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!742 = !{!743, !748, !614, !633}
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !741, line: 41, baseType: !102, size: 32, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0, isUnsigned: true)
!746 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1, isUnsigned: true)
!747 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2, isUnsigned: true)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !749, file: !741, line: 278, baseType: !102, size: 32, elements: !814)
!749 = distinct !DISubprogram(name: "dc_parse_stream", scope: !741, file: !741, line: 266, type: !750, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !740, retainedNodes: !788)
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !753, !29}
!752 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !755, line: 7, baseType: !756)
!755 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !566, line: 49, size: 1728, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !756, file: !566, line: 51, baseType: !45, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !756, file: !566, line: 54, baseType: !7, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !756, file: !566, line: 55, baseType: !7, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !756, file: !566, line: 56, baseType: !7, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !756, file: !566, line: 57, baseType: !7, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !756, file: !566, line: 58, baseType: !7, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !756, file: !566, line: 59, baseType: !7, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !756, file: !566, line: 60, baseType: !7, size: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !756, file: !566, line: 61, baseType: !7, size: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !756, file: !566, line: 64, baseType: !7, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !756, file: !566, line: 65, baseType: !7, size: 64, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !756, file: !566, line: 66, baseType: !7, size: 64, offset: 704)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !756, file: !566, line: 68, baseType: !581, size: 64, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !756, file: !566, line: 70, baseType: !772, size: 64, offset: 832)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !756, file: !566, line: 72, baseType: !45, size: 32, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !756, file: !566, line: 73, baseType: !45, size: 32, offset: 928)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !756, file: !566, line: 74, baseType: !160, size: 64, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !756, file: !566, line: 77, baseType: !134, size: 16, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !756, file: !566, line: 78, baseType: !248, size: 8, offset: 1040)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !756, file: !566, line: 79, baseType: !590, size: 8, offset: 1048)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !756, file: !566, line: 81, baseType: !594, size: 64, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !756, file: !566, line: 89, baseType: !124, size: 64, offset: 1152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !756, file: !566, line: 91, baseType: !598, size: 64, offset: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !756, file: !566, line: 92, baseType: !601, size: 64, offset: 1280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !756, file: !566, line: 93, baseType: !772, size: 64, offset: 1344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !756, file: !566, line: 94, baseType: !6, size: 64, offset: 1408)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !756, file: !566, line: 95, baseType: !23, size: 64, offset: 1472)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !756, file: !566, line: 96, baseType: !45, size: 32, offset: 1536)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !756, file: !566, line: 98, baseType: !80, size: 160, offset: 1568)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !802, !803, !804}
!789 = !DILocalVariable(name: "fp", arg: 1, scope: !749, file: !741, line: 266, type: !753)
!790 = !DILocalVariable(name: "filename", arg: 2, scope: !749, file: !741, line: 266, type: !29)
!791 = !DILocalVariable(name: "line_number", scope: !749, file: !741, line: 268, type: !23)
!792 = !DILocalVariable(name: "next_G_line", scope: !749, file: !741, line: 269, type: !29)
!793 = !DILocalVariable(name: "input_line", scope: !749, file: !741, line: 270, type: !7)
!794 = !DILocalVariable(name: "input_line_size", scope: !749, file: !741, line: 271, type: !23)
!795 = !DILocalVariable(name: "line", scope: !749, file: !741, line: 272, type: !29)
!796 = !DILocalVariable(name: "term", scope: !749, file: !741, line: 273, type: !29)
!797 = !DILocalVariable(name: "colorterm", scope: !749, file: !741, line: 274, type: !29)
!798 = !DILocalVariable(name: "ok", scope: !749, file: !741, line: 275, type: !752)
!799 = !DILocalVariable(name: "state", scope: !749, file: !741, line: 278, type: !748)
!800 = !DILocalVariable(name: "keywd", scope: !801, file: !741, line: 292, type: !7)
!801 = distinct !DILexicalBlock(scope: !749, file: !741, line: 291, column: 5)
!802 = !DILocalVariable(name: "arg", scope: !801, file: !741, line: 292, type: !7)
!803 = !DILocalVariable(name: "unrecognized", scope: !801, file: !741, line: 293, type: !752)
!804 = !DILocalVariable(name: "i", scope: !805, file: !741, line: 358, type: !45)
!805 = distinct !DILexicalBlock(scope: !806, file: !741, line: 357, column: 17)
!806 = distinct !DILexicalBlock(scope: !807, file: !741, line: 350, column: 24)
!807 = distinct !DILexicalBlock(scope: !808, file: !741, line: 348, column: 24)
!808 = distinct !DILexicalBlock(scope: !809, file: !741, line: 346, column: 19)
!809 = distinct !DILexicalBlock(scope: !810, file: !741, line: 345, column: 13)
!810 = distinct !DILexicalBlock(scope: !811, file: !741, line: 344, column: 15)
!811 = distinct !DILexicalBlock(scope: !812, file: !741, line: 340, column: 9)
!812 = distinct !DILexicalBlock(scope: !813, file: !741, line: 334, column: 16)
!813 = distinct !DILexicalBlock(scope: !801, file: !741, line: 329, column: 11)
!814 = !{!815, !816, !817, !818}
!815 = !DIEnumerator(name: "ST_TERMNO", value: 0, isUnsigned: true)
!816 = !DIEnumerator(name: "ST_TERMYES", value: 1, isUnsigned: true)
!817 = !DIEnumerator(name: "ST_TERMSURE", value: 2, isUnsigned: true)
!818 = !DIEnumerator(name: "ST_GLOBAL", value: 3, isUnsigned: true)
!819 = !{!29, !820, !823, !827, !831, !835, !7, !6, !849, !853, !857, !861, !864, !23, !918, !921, !924, !926, !929, !931, !10, !696, !934, !45, !134, !938, !941, !944, !948}
!820 = !DISubprogram(name: "fputs_unlocked", scope: !561, file: !561, line: 662, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!821 = !DISubroutineType(types: !822)
!822 = !{!45, !29, !772}
!823 = !DISubprogram(name: "set_program_name", scope: !824, file: !824, line: 37, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!824 = !DIFile(filename: "../lib/progname.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!825 = !DISubroutineType(types: !826)
!826 = !{null, !29}
!827 = !DISubprogram(name: "setlocale", scope: !828, file: !828, line: 122, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!828 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!829 = !DISubroutineType(types: !830)
!830 = !{!7, !45, !29}
!831 = !DISubprogram(name: "atexit", scope: !832, file: !832, line: 595, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!832 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!833 = !DISubroutineType(types: !834)
!834 = !{!45, !48}
!835 = !DISubprogram(name: "getopt_long", scope: !836, file: !836, line: 66, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!836 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!837 = !DISubroutineType(types: !838)
!838 = !{!45, !45, !839, !29, !841, !668}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !836, line: 50, size: 256, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !836, line: 52, baseType: !29, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !843, file: !836, line: 55, baseType: !45, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !836, line: 56, baseType: !668, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !843, file: !836, line: 57, baseType: !45, size: 32, offset: 192)
!849 = !DISubprogram(name: "version_etc", scope: !850, file: !850, line: 65, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!850 = !DIFile(filename: "../lib/version-etc.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!851 = !DISubroutineType(types: !852)
!852 = !{null, !772, !29, !29, !29, null}
!853 = !DISubprogram(name: "error", scope: !854, file: !854, line: 33, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!854 = !DIFile(filename: "../lib/error.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!855 = !DISubroutineType(types: !856)
!856 = !{null, !45, !45, !29, null}
!857 = !DISubprogram(name: "quote", scope: !858, file: !858, line: 44, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!858 = !DIFile(filename: "../lib/quote.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!859 = !DISubroutineType(types: !860)
!860 = !{!29, !29}
!861 = !DISubprogram(name: "puts", scope: !561, file: !561, line: 632, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!862 = !DISubroutineType(types: !863)
!863 = !{!45, !29}
!864 = !DISubprogram(name: "_obstack_begin", scope: !865, file: !865, line: 214, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!865 = !DIFile(filename: "../lib/obstack.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!866 = !DISubroutineType(types: !867)
!867 = !{!45, !868, !10, !10, !915, !906}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !865, line: 173, size: 704, elements: !870)
!870 = !{!871, !872, !882, !883, !884, !885, !890, !891, !902, !911, !912, !913, !914}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !869, file: !865, line: 175, baseType: !23, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !869, file: !865, line: 176, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !865, line: 166, size: 128, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !874, file: !865, line: 168, baseType: !7, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !874, file: !865, line: 169, baseType: !873, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !874, file: !865, line: 170, baseType: !879, offset: 128)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: -1)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !869, file: !865, line: 177, baseType: !7, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !869, file: !865, line: 178, baseType: !7, size: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !869, file: !865, line: 179, baseType: !7, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !869, file: !865, line: 184, baseType: !886, size: 64, offset: 320)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !865, line: 180, size: 64, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !886, file: !865, line: 182, baseType: !23, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !886, file: !865, line: 183, baseType: !6, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !869, file: !865, line: 185, baseType: !23, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !869, file: !865, line: 192, baseType: !892, size: 64, offset: 448)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !865, line: 188, size: 64, elements: !893)
!893 = !{!894, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !892, file: !865, line: 190, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!6, !23}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !892, file: !865, line: 191, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!6, !6, !23}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !869, file: !865, line: 197, baseType: !903, size: 64, offset: 512)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !865, line: 193, size: 64, elements: !904)
!904 = !{!905, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !903, file: !865, line: 195, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !903, file: !865, line: 196, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !6, !6}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !869, file: !865, line: 199, baseType: !6, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !869, file: !865, line: 200, baseType: !102, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !869, file: !865, line: 201, baseType: !102, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !869, file: !865, line: 205, baseType: !102, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!6, !10}
!918 = !DISubprogram(name: "fwrite_unlocked", scope: !561, file: !561, line: 675, type: !919, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!919 = !DISubroutineType(types: !920)
!920 = !{!10, !197, !10, !10, !772}
!921 = !DISubprogram(name: "getenv", scope: !832, file: !832, line: 634, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!922 = !DISubroutineType(types: !923)
!923 = !{!7, !29}
!924 = !DISubprogram(name: "last_component", scope: !925, file: !925, line: 66, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!925 = !DIFile(filename: "../lib/basename-lgpl.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!926 = !DISubprogram(name: "getline", scope: !561, file: !561, line: 616, type: !927, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!927 = !DISubroutineType(types: !928)
!928 = !{!121, !37, !9, !772}
!929 = !DISubprogram(name: "rpl_free", scope: !930, file: !930, line: 739, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!930 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!931 = !DISubprogram(name: "quotearg_n_style_colon", scope: !615, file: !615, line: 403, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!932 = !DISubroutineType(types: !933)
!933 = !{!7, !45, !614, !29}
!934 = !DISubprogram(name: "fnmatch", scope: !935, file: !935, line: 56, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!935 = !DIFile(filename: "/usr/include/fnmatch.h", directory: "")
!936 = !DISubroutineType(types: !937)
!937 = !{!45, !29, !29, !45}
!938 = !DISubprogram(name: "ximemdup0", scope: !637, file: !637, line: 98, type: !939, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!939 = !DISubroutineType(types: !940)
!940 = !{!7, !197, !121}
!941 = !DISubprogram(name: "_obstack_newchunk", scope: !865, file: !865, line: 212, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !868, !10}
!944 = !DISubprogram(name: "freopen_safer", scope: !945, file: !945, line: 28, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!945 = !DIFile(filename: "../lib/stdio-safer.h", directory: "/home/dobios/Documents/AutomatedSoftwareTesting/Assignment_2/klee/coreutils/obj-llvm")
!946 = !DISubroutineType(types: !947)
